#Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.

n = input('Введите дробное число:')
s = 0
for digit in n:
    if digit.isdigit():
        s += int(digit)
print("Сумма:", s)
